Австралия/src/Documents/ForeignCurrencyExchange/ForeignCurrencyExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ForeignCurrencyExchange</name>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesCashMethod</registerRecords>
  <registerRecords>AccumulationRegister.BankCharges</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.BankReconciliation</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.CashAssets</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>FromAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>FromAccountCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>FromAccountExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FromAccountMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>ToAccountCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ToAccountExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToAccountMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>BankCharge</name>
    <type>
      <types>CatalogRef.BankCharges</types>
    </type>
  </attributes>
  <attributes>
    <name>BankChargeItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>BankFeeValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashExchange</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalReceivingCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ManualTotalReceivingCurrency</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/ForeignCurrencyExchange/Forms/ListForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillCompaniesList();
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
	FixedArrayCompanies = New FixedArray(CompaniesList.UnloadValues());
	NewParameter = New ChoiceParameter("Filter.Owner", FixedArrayCompanies);
	NewArray = New Array();
	NewArray.Add(NewParameter);
	NewParameters = New FixedArray(NewArray);
	Items.FilterFromAccount.ChoiceParameters = NewParameters;
	Items.FilterToAccount.ChoiceParameters = NewParameters;
	
EndProcedure

&AtClient
Procedure FilterCompanyOnChange(Item)
	
	If ValueIsFilled(FilterCompany) Then
	
		NewParameter = New ChoiceParameter("Filter.Owner", FilterCompany);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items.FilterFromAccount.ChoiceParameters = NewParameters;
		Items.FilterToAccount.ChoiceParameters = NewParameters;
	
	Else
	
		FixedArrayCompanies = New FixedArray(CompaniesList.UnloadValues());
		NewParameter = New ChoiceParameter("Filter.Owner", FixedArrayCompanies);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items.FilterFromAccount.ChoiceParameters = NewParameters;
		Items.FilterToAccount.ChoiceParameters = NewParameters;
	
	EndIf; 
	
	DriveClientServer.SetListFilterItem(List, "Company", FilterCompany, ValueIsFilled(FilterCompany));
	
EndProcedure

&AtClient
Procedure FilterFromAccountOnChange(Item)
	
	SetCompanyFromAccount(FilterFromAccount);
	DriveClientServer.SetListFilterItem(List, "FromAccount", FilterFromAccount, ValueIsFilled(FilterFromAccount));
	
EndProcedure

&AtClient
Procedure FilterToAccountOnChange(Item)
	
	SetCompanyFromAccount(FilterToAccount);
	DriveClientServer.SetListFilterItem(List, "ToAccount", FilterToAccount, ValueIsFilled(FilterToAccount));
	
EndProcedure

&AtClient
Procedure FilterFromAccountStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	
	OpenSelectAccountForm(Item);
	
EndProcedure

&AtClient
Procedure FilterFromAccountChoiceProcessing(Item, SelectedValue, StandardProcessing)
	
	StandardProcessing = False;
	
	If TypeOf(SelectedValue) = Type("Structure") Then
		
		FilterFromAccount = SelectedValue.Catalog;
		
		SetCompanyFromAccount(FilterFromAccount);
		
		DriveClientServer.SetListFilterItem(List, "FromAccount", FilterFromAccount, ValueIsFilled(FilterFromAccount));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure FilterToAccountStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	
	OpenSelectAccountForm(Item);
	
EndProcedure

&AtClient
Procedure FilterToAccountChoiceProcessing(Item, SelectedValue, StandardProcessing)
	
	StandardProcessing = False;
	
	If TypeOf(SelectedValue) = Type("Structure") Then
		
		FilterToAccount = SelectedValue.Catalog;
		
		SetCompanyFromAccount(FilterToAccount);
		
		DriveClientServer.SetListFilterItem(List, "ToAccount", FilterToAccount, ValueIsFilled(FilterToAccount));
		
	EndIf;
	
EndProcedure

#EndRegion

#Region ListFormTableItemsEventHandlers

&AtClient
Procedure ListOnActivateRow(Item)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure SetCompanyFromAccount(Account)
	
	If TypeOf(Account) = Type("CatalogRef.BankAccounts") Then
		FilterCompany = GetCompany(Account);
	Else
		FilterCompany = PredefinedValue("Catalog.Companies.EmptyRef");
	EndIf;
	
	FilterCompanyOnChange(Undefined);
	
EndProcedure

&AtServer
Function GetCompany(Account)
	Return Common.ObjectAttributeValue(Account, "Owner");
EndFunction

&AtClient
Procedure OpenSelectAccountForm(Item)
	
	ParameterStructure = New Structure;
	
	FilterArray = New Array;
	
	If ValueIsFilled(FilterCompany) Then
		
		FilterArray.Add(FilterCompany);
		
	Else
		
		FilterArray = CompaniesList.UnloadValues();
		
	EndIf;
	
	FilterArray.Add(PredefinedValue("Catalog.Companies.EmptyRef"));
	
	StructureFilter = New Structure();
	StructureFilter.Insert("Owner", FilterArray);
	
	ParameterStructure.Insert("Filter", StructureFilter);
	
	OpenForm("CommonForm.SelectBankCashAccount", ParameterStructure, Item);
	
EndProcedure

&AtServer
Procedure FillCompaniesList()
	
	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED
	|	Companies.Ref AS Ref
	|FROM
	|	Catalog.Companies AS Companies";
	
	CompaniesList.LoadValues(Query.Execute().Unload().UnloadColumn("Ref"));
	
EndProcedure

#Region LibrariesHandlers

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	AttachableCommandsClient.ExecuteCommand(ThisObject, Command, Items.List);
EndProcedure

&AtServer
Procedure Attachable_ExecuteCommandAtServer(Context, Result)
	AttachableCommands.ExecuteCommand(ThisObject, Context, Items.List, Result);
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Items.List);
EndProcedure
// End StandardSubsystems.AttachableCommands

#EndRegion

#EndRegion
